%% СПРАВОЧНИК
clc
clear
keySet = {' ', 'О', 'Е', 'А', 'И', 'Н', 'Т', 'С', 'Р', 'В', 'Л', ...
    'К', 'М', 'Д', 'П', 'У', 'Я', 'Ы', 'З', 'Ъ', 'Б', 'Г', 'Ч', ...
    'Й', 'Х', 'Ж', 'Ю', 'Ш', 'Ц', 'Щ', 'Э', 'Ф', 'Ь'};
valueSet = [0.175, 0.090, 0.072, 0.062, 0.062, 0.053, 0.053, 0.045, ...
    0.040, 0.038, 0.035, 0.028, 0.026, 0.025, 0.023, 0.021, 0.018, ...
    0.016, 0.016, 0.014, 0.014, 0.013, 0.012, 0.010, 0.009, 0.007, ...
    0.006, 0.006, 0.004, 0.003, 0.003, 0.002, 0.014];
P = containers.Map(keySet,valueSet);
%% Канальная матрица P(b/a)
disp(['#################################################################'])
disp(['ЗАДАНИЕ №1'])
disp(['#################################################################'])
disp(['Канальная матрица P(b/a)'])
Pba = zeros(4);
Pba = [1-(P('А')+P('Л')+P('Ь')) P('А') P('Л') P('Ь'); ...
    P('Ч') 1-(P('Ч')+P('А')+P('К')) P('А') P('К'); ...
    P('О') P('В') 1-(P('О')+P('В')+P('В')) P('В'); ...
    P('А') P('С') P('И') 1-(P('А')+P('С')+P('И'))]
%% Матрица P(a,b)
disp(['#################################################################'])
disp(['ЗАДАНИЕ №2'])
disp(['#################################################################'])
disp(['Матрица P(a,b)'])
Pa = [0.1 0.2 0.3 0.4];
Pa_b = zeros(4);
for i = 1:4
    for j = 1:4
        Pa_b(i,j) = Pba(i,j)*Pa(i);
    end
end
Pa_b
% Проверка свойств матрицы
disp(['Проверка свойств матрицы P(a,b)'])
for i = 1:4
    summa = 0.0;
    for j = 1:4
        summa = summa + Pa_b(i,j);
    end
    disp(['P(a' num2str(i) ') = ' num2str(summa)])
end
%% Расчет элементов P(b)
disp(['#################################################################'])
disp(['ЗАДАНИЕ №3'])
disp(['#################################################################'])
disp([' '])
disp(['Расчет элементов P(b)'])
Pb = zeros(1,4);
for j = 1:4
    summa = 0.0;
    for i = 1:4
        summa = summa + Pa_b(i,j);
    end
    Pb(j) = summa;
    disp(['P(b' num2str(j) ') = ' num2str(summa)])
end
%% Канальная матрица P(a/b)
disp(['#################################################################'])
disp(['ЗАДАНИЕ №4'])
disp(['#################################################################'])
disp([' '])
disp(['Канальная матрица P(a/b)'])
Pab = zeros(4);
for i = 1:4
    for j = 1:4
        Pab(i,j) = Pa_b(i,j)/Pb(j);
    end
end
Pab
% Проверка свойств матрицы
disp(['Проверка свойств матрицы P(a/b)'])
for j = 1:4
    summa = 0.0;
    for i = 1:4
        summa = summa + Pab(i,j);
    end
    disp(['Col (' num2str(j) ') = ' num2str(summa)])
end
%% Частные условные энтропии
disp(['#################################################################'])
disp(['ЗАДАНИЕ №5'])
disp(['#################################################################'])
Hbja1 = 0.0;
for j = 1:4
    Hbja1 = Hbja1 + Pba(1,j)*log2(Pba(1,j));
end
Hbja1 = Hbja1*-1;
disp([' '])
disp(['Частная условная энтропия H(bj/a1) = ' num2str(Hbja1)])

Haib1 = 0.0;
for i = 1:4
    Haib1 = Haib1 + Pab(1,i)*log2(Pab(1,i));
end
Haib1 = Haib1*-1;
disp([' '])
disp(['Частная условная энтропия H(ai/b1) = ' num2str(Haib1)])
%% Общая условная энтропия
disp(['#################################################################'])
disp(['ЗАДАНИЕ №6'])
disp(['#################################################################'])
HBA = 0.0;
for i = 1:4
    summa = 0.0;
    for j = 1:4
        summa = summa + Pba(i,j)*log2(Pba(i,j));
    end
    HBA = HBA + summa*Pa(i);
end
HBA = HBA*-1;
disp([' '])
disp(['Общая условная энтропия H(B/A) = ' num2str(HBA)])

HAB = 0.0;
for j = 1:4
    summa = 0.0;
    for i = 1:4
        summa = summa + Pab(i,j)*log2(Pab(i,j));
    end
    HAB = HAB + summa*Pb(j);
end
HAB = HAB*-1;
disp([' '])
disp(['Общая условная энтропия H(A/B) = ' num2str(HAB)])
%% Энтропия объединения
disp(['#################################################################'])
disp(['ЗАДАНИЕ №7'])
disp(['#################################################################'])
% Способ №1
HA_B1 = 0.0;
for i = 1:4
    for j = 1:4
        HA_B1 = HA_B1 + Pa_b(i,j)*log2(Pa_b(i,j));
    end
end
HA_B1 = HA_B1*-1;
disp([' '])
disp(['Энтропия объединения. Способ 1: H(A,B) = ' num2str(HA_B1)])
% Способ №2
HA = 0.0;
for i = 1:4
    HA = HA + Pa(i)*log2(Pa(i));
end
HA = HA*-1;
disp([' '])
disp(['Энтропия H(A) = ' num2str(HA)])
HA_B2 = HA + HBA;
disp(['Энтропия объединения. Способ 2: H(A,B) = ' num2str(HA_B2)])
% Способ №3
HB = 0.0;
for j = 1:4
    HB = HB + Pb(j)*log2(Pb(j));
end
HB = HB*-1;
disp([' '])
disp(['Энтропия H(B) = ' num2str(HB)])
HA_B3 = HB + HAB;
disp(['Энтропия объединения. Способ 3: H(A,B) = ' num2str(HA_B3)])
%% Количество информации
disp(['#################################################################'])
disp(['ЗАДАНИЕ №8'])
disp(['#################################################################'])
disp([' '])
% Спопоб №1
IAB1 = HA + HB - HA_B1;
disp(['Количество информации. Способ 1: I(A,B) = ' num2str(IAB1)])
% Спопоб №2
IAB2 = HA - HAB;
disp(['Количество информации. Способ 2: I(A,B) = ' num2str(IAB2)])
% Спопоб №3
IAB3 = HB - HBA;
disp(['Количество информации. Способ 3: I(A,B) = ' num2str(IAB3)])